Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.automated_step_function_log_group will be created
+ resource "aws_cloudwatch_log_group" "automated_step_function_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/automated_wrestleutopia_workflow2"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_log_group.step_function_log_group will be destroyed
  # (because aws_cloudwatch_log_group.step_function_log_group is not in configuration)
- resource "aws_cloudwatch_log_group" "step_function_log_group" {
      - arn               = "arn:aws:logs:us-east-2:390402544450:log-group:/aws/vendedlogs/states/automated_wrestleutopia_workflow2" -> null
      - id                = "/aws/vendedlogs/states/automated_wrestleutopia_workflow2" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/vendedlogs/states/automated_wrestleutopia_workflow2" -> null
      - retention_in_days = 14 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "wrestleutopia"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_sfn_state_machine.automated_workflow will be updated in-place
~ resource "aws_sfn_state_machine" "automated_workflow" {
        id                        = "arn:aws:states:us-east-2:390402544450:stateMachine:automated_wrestleutopia_workflow"
        name                      = "automated_wrestleutopia_workflow"
        tags                      = {}
        # (12 unchanged attributes hidden)

      ~ logging_configuration {
          ~ log_destination        = "arn:aws:logs:us-east-2:390402544450:log-group:/aws/vendedlogs/states/automated_wrestleutopia_workflow:*" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```